<template>
  <div id="newContentDetails" class="text-left container-fluid">
    <div class="title" v-cloak>{{details['title']}}</div>
    <div class="date" v-cloak>{{details['date']}}，by：{{details['author']}}</div>
    <div class="details" v-for="(item, index) in details['details']" :key="index">
      <div class="details-title" v-if="item['title']" v-cloak>{{item['title']}}</div>
      <div class="details-content" v-if="item['content']" v-cloak>{{item['content']}}</div>
      <div class="details-img" v-if="item['url']"><img v-lazy="item['url']"></div>
    </div>
    <div class="prev-next">
      <a @click="bindPrevNextBTN('prev')" class="pull-left" v-cloak>{{prevNextbtn.prevText}}</a>
      <a @click="bindPrevNextBTN('next')" class="pull-right" v-cloak>{{prevNextbtn.nextText}}</a>
      <div class="clearfix"></div>
    </div>
  </div>
</template>
<script type='text/ecmascript-6'>
  export default{
    data () {
      return {
        prevNextbtn: {
          prevText: '上一篇',
          prevLink: {
            path: '',
            query: {
              id: ''
            }
          },
          nextText: '下一篇',
          nextLink: {
            path: '',
            query: {
              id: ''
            }
          }
        },
        details: {}
      }
    },
    watch: {
      '$route' () {
        window.scrollTo(0, 0)
//      获取上下一遍的id
//      初始化上下页按钮
        initNewsBTN(this)
//      初始化新闻具体内容
        initNewsDetails(this)
      }
    },
    created () {
      window.scrollTo(0, 0)
//      初始化上下页按钮
      initNewsBTN(this)
//      初始化新闻具体内容
      initNewsDetails(this)
    },
    methods: {
      bindPrevNextBTN (str) {
        try {
          let newsStor = sessionStorage.getItem('news')
          newsStor = JSON.parse(newsStor)
          let index = newsStor['index'] - 0
          let arr = newsStor['arr']
          if (str === 'prev') {
            index = index === 0 ? 0 : index - 1
          } else {
            index = index === arr.length - 1 ? index : index + 1
          }
          sessionStorage.setItem('news', JSON.stringify({
            index: index,
            arr: arr
          }))
          if (str === 'prev') {
            this.$router.push(this.prevNextbtn.prevLink)
          }
          if (str === 'next') {
            this.$router.push(this.prevNextbtn.nextLink)
          }
        } catch (e) {
          return this.$router.push('/news')
        }
      }
    }
  }
  /**
   * 初始化上下页按钮
   */
  function initNewsBTN (_this) {
    let newsStor = sessionStorage.getItem('news')
    try {
      newsStor = JSON.parse(newsStor)
      let index = newsStor['index'] - 0
      let newsArr = newsStor['arr']
      if (index !== 0) {
        _this.prevNextbtn.prevLink.path = newsArr[index - 1]['link']['path']
        _this.prevNextbtn.prevLink.query = newsArr[index - 1]['link']['query']
        _this.prevNextbtn.prevText = '上一篇'
      } else {
        _this.prevNextbtn.prevText = '没有上一篇'
      }
      if (index !== newsArr.length - 1) {
        _this.prevNextbtn.nextLink.path = newsArr[index + 1]['link']['path']
        _this.prevNextbtn.nextLink.query = newsArr[index + 1]['link']['query']
        _this.prevNextbtn.nextText = '下一篇'
      } else {
        _this.prevNextbtn.nextText = '没有下一篇'
      }
    } catch (e) {
      return _this.$router.push('/news')
    }
  }
  /**
   * 初始化新闻具体内容
   */
  function initNewsDetails (_this) {
//    新闻具体内容
    let newsDetailsArr = [
      {
        title: '智向科技加入阿里IoT合作伙伴联盟',
        date: '2017-06-16',
        id: '20170616',
        author: 'timothy',
        details: [
          {
            content: '2017云栖大会·上海峰会于6月10-11日在上海跨国采购会展中心盛大举办，同期阿里云举办IoT合作伙伴计划大会（2017），联合海尔优家，松下电子，NXP，金雅拓，智向科技等近200多家IoT产业链企业宣布成立“IoT合作伙伴计划联盟”（简称ICA）。'
          },
          {
            content: '首届联盟理事长、阿里云IoT事业部总经理库伟在大会上表示，联盟的目标是建立和培育开放、互通、安全的IoT产业生态，并开放阿里巴巴的生态资源，做大做强整个IoT产业，为此ICA将致力于用互联网思维建设标准与生态，以此作为粘合剂，打通已有技术标准，推动国际标准进而推动整个IoT行业发展。 '
          },
          {
            url: '/beacool/static/images/news_icon02.png'
          },
          {
            content: '物联网发展到现在，依然热火，但产品各异、行业平台林立，标准各异，安全漏洞已成为物联网进一步发展的掣肘，尤其是物联网安全，从云服务，设备，到系统，通讯，每个链条都时时刻刻受到黑客的攻击和其他安全隐患。物联网的安全现在已经成了物联网的当务之急。'
          },
          {
            content: '智向科技做为国内安全可穿戴支付的领先者，通过多年技术积累和努力，以及和公安部三所，安全芯片厂家等的合作，推出了多种支持金融支付，个人身份认证，安全加密等重量级产品。做为ICA联盟安全标准组的成员，智向科技将和其他成员一起打破终端安全连接云服务的技术壁垒，实现安全方案的跨界融合，引导IoT安全行业的发展，共建互赢的安全生态。'
          },
          {
            content: '智向科技成立于2013年，是国内领先的可穿戴支付和位置服务的物联网解决方案提供商和服务商，拥有自主开发研制的结合低功耗蓝牙（BLE）和GPS的低功耗物联场景感知网络，智能感知定位设备，智能可穿戴支付设备，先进的精准定位算法和动作检测算法，云管理和数据服务平台等核心产品和技术。智向科技在蓝牙应用，运动算法，iBeacon应用,定位服务， 可穿戴和支付领域已经申请了数十项发明专利，为包括百度、阿里、通联支付，兴业银行、上海嘉会国际医院、上海正大广场等超过二十多家国内外知名企业提供了服务和合作。'
          }
        ]
      },
      {
        title: '智向科技联合Nordic，推出汽车手环',
        date: '2017-07-24',
        id: '20170724',
        author: '智向科技',
        details: [
          {
            content: 'BeacoolCarFit 手环采用Nordic的nRF52832 SoC提供低功耗蓝牙无线连接性和支持处理器密集应用。'
          },
          {
            url: '/beacool/static/images/news_icon01.png'
          },
          {
            content: '超低功耗(ULP)射频专家Nordic Semiconductor宣布国内的智能定位技术综合解决方案提供商 – 上海智向科技公司选择了Nordic屡获殊荣的nRF52832低功耗蓝牙系统级芯片(SoC)用于其BeacoolCarFit手环。这种多功能器件不仅报告健康指标，而且集成了电子支付及多项汽车功能的远程控制。'
          },
          {
            content: 'BeacoolCarFit手环是戴在腕上的可穿戴器件，提供触摸屏和手势控制。这款手环提供一系列健康指标，包括活动跟踪、睡眠数据、体重以及心率，而且还集成了主流信用卡和Apple Pay电子支付。用户还可以利用该器件作为预支付公共交通费，并且通过触摸屏或手势执行多种汽车控制功能。例如，用户可以远程开关车门、升降窗户、开关行李箱、操作空调及甚至启动引擎。据说该器件是中国首款集成汽车远程控制功能的同类腕上器件。'
          },
          {
            content: 'BeacoolCarFit手环采用Nordic的nRF52832 SoC，使得手环能够通过低功耗蓝牙和支持蓝牙4.0(及以后版本)的智能手机和平板电脑以及其它无线网关之间进行无线连接，及处理手环的丰富功能所需的处理器密集算法。Nordic SoC拥有超低功耗特性，使得该手环充一次电可使用1个月以上。'
          },
          {
            content: '上海智向科技创始人郝锋称：“我们之所以选择nRF52832 SoC，是因为其拥有强大的ARM Cortex M4F处理器、低功耗，及大型RAM和Flash存储器，使我们能够在手环上增加众多特性，而且游刃有余地处理动态心率监测、汽车远程控制及手势识别等某些特性所需的复杂算法。”'
          },
          {
            content: '通过上海智向科技公司兼容iOS和安卓的摩赞APP中文应用程序，用户可以利用该手环进行同步和查看锻炼、睡眠和心率的数据，并且进行交通卡激活和充值，和激活信用卡，打电话，发文本或收取信息警示，以及修改或个性化其它用户设置。'
          },
          {
            content: 'Nordic的nRF52832低功耗蓝牙SoC是Nordic第6代超低功耗(ULP)无线连接解决方案的成员，它综合了64MHz、32位 ARM®Cortex® M4F处理器及2.4GHz多协议射频(支持蓝牙5、ANT™及专有2.4GHz 射频软件)，并提供-96dB RX灵敏度、512kB Flash和64kB RAM。发布时，该SoC是世界上最高性能的单芯片低功耗蓝牙解决方案，通用处理能力比竞争产品高60%，并且提供十倍浮点性能和两倍DSP性能。'
          },
          {
            content: 'nRF52832 SoC拥有2.4GHz无线5.5mA峰值RX/TX电流和自动电源管理系统，还最大限度地降低了功耗。与Nordic的nRF51系列SoC相比，nRF52832 SoC功耗降低达80%，其功率效率高达58 CoreMark/mA，是竞争产品的两倍。该SoC配备Nordic的S132 协议栈，这是蓝牙4.2认证射频软件协议栈，用于建立先进的低功耗蓝牙应用。S132协议栈的中央、外设、广播及观察低功耗蓝牙角色可支持高达20个连接，以及实现并行角色操作。'
          },
          {
            content: '郝锋补充称：“Nordic的软件开发套件使用简单，帮助我们加快进度和快速完成CarFit 手环的开发。Nordic还为我们提供了出色的技术支持。”'
          },
          {
            content: '关于上海智向科技公司'
          },
          {
            content: 'http://www.beacool.com'
          }
        ]
      },
      {
        title: '智向科技助力芝麻信用、盼达智能出行发布会',
        date: '2017-05-11',
        id: '20170511',
        author: '智向科技',
        details: [
          {
            content: '2017年5月9日下午，蚂蚁金服旗下芝麻信用联合盼达用车于杭州举行智能出行发布会，在发布会上，智向科技摩赞出行手环，作为与智能汽车互动的黑科技，引爆发布会现场。智向科技作为场景化智能出行领导者，旗下摩赞手环助力盼达用车智能出行。'
          },
          {
            url: '/beacool/static/images/news_icon03.png'
          },
          {
            content: '上海智向科技成立于2013年，先后推出智能定位、支付手环等软硬件结合的场景一体化服务，2016年，智向再推出摩赞出行手环，迈向智能出行与场景化服务相结合的道路。依托智能硬件，结合低功耗场景化物联感知网络，智向科技通过大数据挖掘，为消费用户带来智能出行新体验。'
          },
          {
            title: '精准定位+支付手环，打造场景一体化服务闭环'
          },
          {
            content: '通过感知网络部署，结合硬件信息采集及云端分析，智向科技可为商场、景区等各种场景提供室内地图，室内定位，室内追踪，室内导航等应用，同时依托终端用户轨迹数据分析，还可为终端用户推送广他们附件商家或景点的广告信息，实现软硬件一体的场景化服务。'
          },
          {
            content: '2015年，随着支付手环的发布，智向科技打造场景化服务闭环：运用推送信息、导航实现终端用户引流后，通过支付手环的支付功能，让终端用户与商家发生“实际关系”，为商家带来切实收益。自该手环发布起，与智向科技合作的不乏知名厂家，譬如百度（Baidu），通联支付，四川天府通等等。智向科技已成为国内场景化智能出行解决方案的领导者。'
          },
          {
            content: '感知网络的每个场景化地区依然一个个信息独立“孤体”，如何将这些“孤体”串联，成为其重要的战略布局。就此，2016年，智向再次发布摩赞智能出行手环。'
          },
          {
            title: '摩赞手环发布，做场景化智能出行领先者'
          },
          {
            content: '摩赞出行手环用户在不同场景的穿行，通过手环与场景感知网络、云端平台的信息互动，便将各个场景化信息“孤体”串联，协助智向实现平台大数据统一。智向科技已成为场景智能出行领先者。'
          },
          {
            content: '同时，摩赞出行手环一个重要应用是里面集成了eID的功能，可以做为个人电子安全ID，从而把用户出行过程中的购票，挂失，进站，数据，营销等各个环节有效结合，提供安全便捷，省时省成本的一站式服务。    '
          },
          {
            content: '目前，除地铁、公交、的士等公共交通外，如今智向已与汽车服务商一起，联合推出汽车手环，而通过摩赞出行手环与车联网的结合，智向科技将迈出智能出行更坚实的一步。'
          }
        ]
      },
      {
        title: '智向科技可支付定位智能手环',
        date: '2016-06-01',
        id: '20160601',
        author: '智向科技',
        details: [
          {
            content: '智能可穿戴产业的发展，最早是从运动手环开始。短短的几年时间，运动手环成为了全球最风靡、最成功、最时尚的智能硬件。时至今日，智能可穿戴产业产生了一些新的格局。根据近期报道的调研数据显示，在可穿戴行业细分功能方面，对于运动监测、健康监测及支付几大细分功能最为看好。就目前而言，运动及健康监测仍然最受从业者青睐。用户可以记录日常生活中的锻炼、睡眠、部分还有饮食等实时数据，并将这些数据与手机、平板、ipod touch同步，起到通过数据指导健康生活的作用。手机同步健康数据的同时兼具移动支付功能，对所消费的商品或服务进行账务支付的服务。支付功能目前同样是智能手环生产者们积极实现的销售热点。 '
          },
          {
            url: '/beacool/static/images/news_icon05.png'
          },
          {
            content: '智向科技可支付定位智能手环在具备以上功能的基础上加入了安全 智能芯片及非接触线圈，使得手环可以运用于安全认证 及支付领域，成为安全支付领域的又一全新载体。手环可直接或间接向银行金融机构发送支付指令产生货币支付与资金转移行为实现近场支付,所谓近场支付，就是用手环刷卡的方式乘坐出行交通工具（并可以同时加载多个城市一卡通应用，可以方便乘坐地铁 和公交等交通设施 ）、购物等，提供更多生活的便利性。'
          },
          {
            content: '智向科技可支付定位智能手环在具备以上功能的基础上加入了安全 智能芯片及非接触线圈，使得手环可以运用于安全认证 及支付领域，成为安全支付领域的又一全新载体。手环可直接或间接向银行金融机构发送支付指令产生货币支付与资金转移行为实现近场支付,所谓近场支付，就是用手环刷卡的方式乘坐出行交通工具（并可以同时加载多个城市一卡通应用，可以方便乘坐地铁 和公交等交通设施 ）、购物等，提供更多生活的便利性。 '
          },
          {
            content: '基于更高标准的银行支付体系，国内独家运营捷德TSM平台，国内第一家也是唯一一家通过银联认证的手环，内嵌公安部eID身份认证，且具有独立的安全芯片，无需密码直接登录，独特安全保障。手环在进行移动支付时不依赖网络，无需验证码，支付手环的SE安全芯片无法进行复制，确保支付的安全性。 '
          },
          {
            content: '可以同时加载Mifare应用，可以用于门禁，考勤，停车 场等非定额消费场所移动支付及定位功能。 智向科技智能安全支付定位手环同时支持Apple iBeacon技术，基于蓝牙技术可以 和线下广大的Beacon网络相结合，实现定位追踪和精准营销，并且获得线下的用户物理轨迹。 '
          },
          {
            content: '智向科技智能安全支付定位手环是目前同类产品市场上功能全面性能良好的可穿戴智能设备。保有基础功能的基础上突出了支付和定位的功能，且是国际技术的尖端水准，同样奠定了国内可穿戴智能设备的发展方向与前景。 '
          }
        ]
      },
      {
        title: '智向科技全球首创，情景化安全移动支付投入商用',
        date: '2016-08-01',
        id: '20160801',
        author: '智向科技',
        details: [
          {
            content: '不再被众多的银行卡拖累，轻轻一挥手，手环即可实现安全、快捷的线下支付，这一全球首创的新型安全支付方式2015年5月27日由上海智向科技（Beacool）联合捷德集团全球首发，并在本月实现量产商用。这款新型智能手环不但兼具传统智能手环的运动、睡眠监控功，更创新的推出了安全支付系统，并可实现通过Ibeacon蓝牙技术进行手机APP互动、室内外定位、多平台互动等多种应用延伸。 '
          },
          {
            url: '/beacool/static/images/news_icon04.png'
          },
          {
            content: '本次由智向科技（Beacool）联合捷德集团研发的场景化智能支付手环，基于捷德集团全球支付安全体系的支持，突破了以往智能手环的运动、睡眠状况监测等普通功能，创新性的在智能手环中加入了安全智能芯片及非接触线圈，使得手环可以运用于安全认证及支付领域，成为安全支付领域的又一全新载体。用户可在有“闪付”标识的POS机上实现挥手支付，将手环与手机绑定后，还可进行余额查询和电子钱包的圈存操作，实现了手环与手机APP的互动。使用方法比常见的闪付芯片卡更加方便快捷。此前，国内移动支付主要聚焦于手机支付，这款可穿戴移动支付产品的推出，无疑填补了国内市场的空白。 '
          },
          {
            content: '值得一提的是，针对这款产品，智向科技（Beacool）特别强调了基于蓝牙Ibeacon蓝牙技术的研发，智能可穿戴设备的场景性与以往的设备有本质的区别。智向科技（Beacool）市场营销副总裁李想表示，“基于Ibeacon蓝牙技术的智能穿戴技术市场应用已经非常成熟，这次我们将Ibeacon蓝牙技术和手环结合在一起，完美解决了困扰消费者多年线下场景化支付问题。我们的场景化支付手环将给消费者带来室内导航、优惠折扣信息收集、特惠商户支付提醒等功能并能很好的和手机各类APP进行数据互动，同时给商家带来交叉引流、大数据营销、广告投放入口等，真正实现了020的闭环。” '
          },
          {
            content: '发布会上演示了智向科技（Beacool）已经投入商用的场景化支付智能手环的支付实现过程，与会者亲自体验了手环闪付的便捷与安全。令人瞩目的是，基于银联的“闪付”POS设备的普及，场景化支付智能手环的支付环境已经比较健全，手环穿戴着已经可以方便的在各个消费场所进行“挥手消费”，而无需进行大规模的商户POS改造工程，从而大大减小了支付环境建设的成本和周期。演示现场智向科技（Beacool）还带来了一款基于I beacon协议的产品“beacool盒子”。“beacool盒子”配合场景化支付手环，在消费者抵达特惠商户的时候，手环会自动提醒客户可享受的优惠折扣，并能配合手机和消费者达成良好的互动。现场与会者体验了手机“摇一摇”，商户的优惠券、打折信息、宣传信息甚至等位排队等功能，都在手机中实现。智向科技（Beacool）表示，“beacool盒子”在一定范围内进行批量布放，不但可以实现商户信息交互，更可以扩展地理信息导航功能，以便解决室内导航、停车场寻车、博物馆讲解、医院医导等服务，可谓前景广泛。'
          }
        ]
      },
      {
        title: '智向科技与金联汇通签署合作协议，剑指智能穿戴eID市场',
        date: '2016-01-06',
        id: '20160106',
        author: '智向科技',
        details: [
          {
            content: '近日，上海智向科技信息有限公司与北京金联汇通信息技术有限公司联合宣布在北京签署战略合作协议，智向科技承诺利用自身在智能穿戴与智能蓝牙设备的技术优势，支持金联汇通在eID业务建设上的业务需求并以此为契机，开创国内eID和智能穿戴设备结合的先河。 '
          },
          {
            url: '/beacool/static/images/news_icon07.png'
          },
          {
            content: '金联汇通信息技术有限公司成立于2014年初，是由东方集团和专业信息安全技术团队合作成立的有限责任公司，注册资金5000万元，公司的基本定位是eID 身份服务提供商，面向互联网应用提供身份服务。基于“公安部公民网络身份识别系统”（eID中心），开发并运营eID身份服务平台及增值服务平台，为各类 业务应用提供eID身份服务，并根据应用的个性化需求提供各种eID增值服务，建立起适用于互联网生态环境的网络身份服务体系。 '
          },
          {
            content: '智向科技信息有限公司是国内领先的蓝牙iBeacon™技术和智能可穿戴设备供应商。融合智向科技核心技术的智能可穿戴设备和智向科技的 MarsBeacon网络在银行、地产、零售、公共服务领域已经累计了大量用户群体，并通过合作伙伴与农业银行、招商银行、兴业银行、北京银行、花旗银行 等银行的合作建立了安全可靠的支付与信息管理系统与核心硬件体系。 '
          },
          {
            content: '智向科技信息有限公司，通过线下的iBeacon™的网络搭建，已经逐步建成了以线下数据为核心的大数据服务基础平台，使传统的线下行为可数据化的技术得 以实现。目前智向科技在商业地产、旅游景区、医疗结构等场所的线下数据化服务，已经完善的解决了诸如室内导航、线下热点分析、场景化支付、线下行为分析、 线下移动营销等基于LBS的服务。智向科技正是通过线下数据网络的搭建，成为行业内屈指可数企业级场景化应用解决方案供应商。 '
          },
          {
            content: '本次智向科技与金联汇通的合作协议将面向智能手环的eID系统建设，并将成为智能穿戴设备增加支付功能后的又一次革新。根据金联汇通与公安部第三研究所的 合作协议，公安三所的“公安部公民网络身份识别系统”为网络用户提供基于隐私保护的、权威的网络电子身份（eID），作为eID的登记机构和证书服务机 构，三所将重点着眼于eID的发放，为eID寻找更多的载体，与更多的金融机构合作，将eID发放到每个公民手中，并提供eID基础服务。金联汇通公司将 建设“eID增值服务平台”，基于eID基础服务，为eID载体的持有人和网络交易机构提供实名认证服务、安全登录服务、数字签名服务和交易保护服务等增 值服务，保证交易的实名、可靠和安全，并为用户提供隐私保护功能。智向科技将通过本次合作成为eID载体设备的首家合作供应商，并利用智向科技在智能穿戴 领域的优势，提供加载eID服务的智能手环、智能手表等可穿戴智能硬件。本次合作协议的签署，将预示着智能可穿戴市场的另一场革命即将掀起，智向科技与金 联汇通联手剑指智能穿戴eID市场。 '
          }
        ]
      },
      {
        title: '智向手环新科技防范网络诈骗',
        date: '2016-05-05',
        id: '20160505',
        author: '智向科技',
        details: [
          {
            content: '网络带来便捷生活的同时也存在着潜在的危险隐患。不法分子利用网络进行诈骗的案件屡见不鲜，近期一则短信诈骗消息再度引发对于网络支付安全隐患问题的关注。 '
          },
          {
            url: '/beacool/static/images/news_icon06.png'
          },
          {
            content: '事件回顾： 受害人先收到来自号码“1065800”的一则短信消息，并回复“TD”退订短信， '
          },
          {
            content: '随后收到号码“10086”的短信“提醒开通中广财经半年包业务”及“余额不足“的短信消息 '
          },
          {
            content: '并同时收到号码“10658139013816280086“发来的短信“您成功订阅了中国移动的中广财经40元/半年，3分钟退订免费，如退订请编辑短信“取消+效验证码”至本条短信退订”。署名“中国移动” '
          },
          {
            content: '随后，来源为“10086”短息提醒“尊敬的客户，您的USIM卡6位验证码为******”因受害人不清楚USIM密码，回复了“取消+******”。在完成了以上操作后受害人的钱款从网络账户中一笔笔转出，当受害人意识到要解绑有关联的银行卡时，已经发生了数笔交易，造成了不可挽回的经济损失。 '
          },
          {
            content: '事件发生后受害人最先报警，并向相关银行、百度钱包、支付宝、中国移动等单位进行相关处理沟通，但除支付宝外的其他单位均表示不予以负责或态度消极处理，在一个涉及漏洞如此之多的案件中，究竟是哪个平台的责任？ '
          },
          {
            content: '事后追讨责任归属的同时也需反思日常生活中对网络诈骗警觉性不足，及相关单位对于防范网络诈骗措施的疏忽与怠慢。 '
          },
          {
            content: '在移动支付蓬勃发展的同事，用户因手机中毒、电信诈骗、手机丢失而导致的资金被盗按键频频发生，移动支付的安全问题不容忽视。目前，移动支付安全最薄弱的环节在于支付鉴权与支付端不分离，导致了各种风险的发生。比如手机被盗或者手机号码被诈骗团伙复制，都会导致犯罪分子可以利用支付鉴权进行资金盗刷。如果支付鉴权设置在一个更高安全级别的载体上，或者和支付终端分离，则用户可以有效的避免验证码被窃取的风险。 '
          },
          {
            content: '智向科技基于更高标准的银行支付体系，推出的智能可穿戴设备“智向手环”，国内独家运营捷德TSM平台，国内第一家也是唯一一家通过银联认证的手环，内嵌公安部eID身份认证，且具有独立的安全芯片，无需密码直接登录，独特安全保障。手环在进行移动支付时不依赖网络，无需验证码，支付手环的SE安全芯片无法进行复制，从而不法分子无可乘之机。 '
          },
          {
            content: '智向手环（智能安全支付手环） '
          },
          {
            content: '1、 国内第一家及唯一通过人民银行PBO3.0和银联安全支付认证的非接支付设备 '
          },
          {
            content: '2、多家银行为其安全性提供保障 '
          },
          {
            content: '3、内置SE安全支付模块，物理保障安全性 '
          },
          {
            content: '4、支持现有智能穿戴式设备所有功能 '
          },
          {
            content: '5、支持非接闪付和蓝颜两种支付方式，可以通过市面上目前大多数POS机进行线上和线下支付 '
          },
          {
            content: '6、 结合Beacon网络，应用于多种支付场景和精准营销 '
          },
          {
            content: '智向手环如何解决线上支付绑卡和安全问题？ '
          },
          {
            content: '微信、支付宝、Apple pay是目前最常用的第三方移动支付形式。智向手环已经不再局限于是智能手机的延伸，除运动检测、健康监测外，还具备了定位、呼救等功能，且百分百杜绝信息泄露是国内目前最安全的第三方移动支付设备。同时也简化了C端使用者的使用流程。 '
          },
          {
            content: '“物联网”是时下非常流行的名词和一种新技术，可以让设备与智能手机通过无线互联网连接，实现更方便的智能应用体验。未来的市场“设备将摆脱手机独立运行” 目前所有的可穿戴设备都需要连接智能手机才能使用，拥有很大的局限性。能够独立运行的设备将拥有更多卖点和市场前景。智向手环开拓了先行之路！科技安全的保驾护航更优的独立使用感受。你值得拥有！ '
          }
        ]
      }
    ]
    let id = _this.$route.query.id + ''
    for (let i in newsDetailsArr) {
      if (id === newsDetailsArr[i]['id']) {
        _this.details = newsDetailsArr[i]
        break
      }
    }
  }
</script>
<style type='text/css' rel='stylesheet'>
  #newContentDetails{
    background: #fff;
  }
  #newContentDetails .title{
    font-size: 18px;
    line-height: 30px;
  }
  @media (min-width: 992px){
    #newContentDetails .title{
      font-size: 30px;
      line-height: 50px;
    }
  }
  #newContentDetails .date{
    font-size: 12px;
    color: #999;
  }
  #newContentDetails .prev-next{
    padding: 15px;
  }
  #newContentDetails .details .details-title{
    font-size: 16px;
    line-height: 30px;
  }
  #newContentDetails .details  .details-content{
    font-size: 14px;
    line-height: 24px;
    text-indent: 30px;
    margin: 6px 0;
  }
</style>
